class InnerText {

	static privacyHtml = `
	 <p>Сайт unreal-go.top приділяє велику увагу захисту персональних даних своїх користувачів. Користувачі сайту unreal-go.top можуть переглядати вміст сайту не повідомляючи про себе ніяких персональних даних. Однак, для надання послуг, пов'язаних з купівлею товарів, представлених в нашому інтернет-магазині, нам потрібні Ваші контактні дані для того, щоб ми могли зв'язатися з Вами, підтвердити замовлення і доставити Вам замовлений товар. Ваші персональні дані ми не передаємо третім особам і захищаємо їх конфіденційність.</p>
            <h4>ЗАГАЛЬНІ ПОЛОЖЕННЯ</h4>
            <p>Дана політика конфіденційності встановлює порядок отримання, зберігання, обробки, використання і розкриття персональних даних Користувача. Персональні дані Користувача ми отримуємо від Користувача при оформленні замовлення через корзину магазина, при оформленні замовлення за телефонами, які вказані на сайті, і при реєстрації самим Користувачем (створення Особистого кабінету). Персональні дані Користувача заповнюються Користувачем (при оформленні замовлення або при реєстрації на сайті). Обов'язкова для надання послуги інформація позначена спеціальним чином. Інша інформація надається Користувачем на його розсуд.</p>
            <p>Конфіденційність персональних даних - обов'язкова умова для дотримання магазином доступу до персональних даних Користувача, з вимогою не допускати їх поширення без згоди Користувача або наявності іншої законної підстави.</p>
            <p>Використання Користувачем сайту інтернет-магазину unreal-go.top означає згоду з цією Політикою конфіденційності та умовами обробки персональних даних Користувача.</p>
            <p>У випадку незгоди з умовами Політики Користувач повинен припинити використання сайту інтернет-магазину unreal-go.top.</p>
            <p>Ця Політика застосовується тільки до сайту інтернет-магазину unreal-go.top. Інтернет-магазин unreal-go.top не контролює і не несе відповідальність за сайти третіх осіб, на які Користувач може перейти по посиланнях, доступним на сайті інтернет-магазину unreal-go.top.</p>
            <p>Адміністрація сайту не перевіряє достовірність персональних даних, що надаються Користувачем сайту Інтернет-магазину.</p>
            <p>Користувач визнає, що в разі недбалого ставлення самим Користувачем до безпечного зберігання свого логіна і пароля, що дає доступ до його персональних даних, треті особи можуть отримати несанкціонований доступ до облікового запису, персональних і інших даних Користувача. Інтернет-магазин unreal-go.top не несе відповідальність за збитки завдані таким доступом.</p>
            <h4>ПЕРСОНАЛЬНІ ДАНІ</h4>
            <p>Сайт unreal-go.top збирає персональні дані, а саме: ім'я, прізвище, контактний телефон, електрона та для доставки. Також, ця інформація може уточнюватись від Вас по телефону.</p>
            <p>Інша інформація надається Користувачем на його розсуд.</p>
            <p>Інтернет-магазин unreal-go.top не збирає IP-адреси користувачів.</p>
            <h4>ЦІЛІ ЗБОРУ І ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ</h4>
            <p>Сайт unreal-go.top збирає і зберігає тільки ті персональні дані, які необхідні для надання послуг з продажу і доставки замовлених Вами товарів.</p>
            <p>Сайт unreal-go.top збирає дані для зв'язку з Користувачем, в тому числі подання відповідного повідомлення про надання послуги, інформування Користувача про наявність товару, підтвердження замовлення, доставки замовлених Користувачем товарів, для зв'язку кур'єрської служби з Користувачем, а також для обробки запитів і заявок від Користувача.</p>
            <p>Обробка персональних даних Користувача здійснюється без обмеження терміну, будь-яким законним способом.</p>
            <h4>УМОВИ НАДАННЯ ДОСТУПУ ДО БАЗИ ДАНИХ</h4>
            <p>Ми не передаємо персональні дані Користувача третім особам крім випадків визначених законодавством України.</p>
            <p>Розкриття персональних даних Користувача проводиться при замовленні Користувачем товарів в інтернет-магазині unreal-go.top. Зокрема Користувач погоджується з тим, що інтернет-магазин unreal-go.top має права передавати персональні дані кур'єрським службам, організаціям поштового зв'язку, операторам електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на сайті інтернет-магазину unreal-go.top, включаючи доставку Товару.
            </p>
            <p>При втраті або розголошення персональних даних інтернет-магазин unreal-go.top інформує Користувача про втрату або розголошення персональних даних.</p>
            <p>Сайт unreal-go.top приймає необхідні організаційні та технічні заходи для захисту персональної інформації Користувача від неправомірного або випадкового доступу, знищення, перекручення, блокування, копіювання, поширення, а також від інших неправомірних дій третіх осіб.</p>
            <h4>ЗМІНА КОРИСТУВАЧЕМ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ</h4>
            <p>Користувач може в будь-який момент змінити (оновити, доповнити, видалити) надану їм персональну інформацію або її частину, скориставшись функцією входу в "Особистий кабінет".</p>
            <h4>ЗМІНА ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h4>
            <p>Ми маємо право змінити умови Політики конфіденційності. У такому випадку, ми замінимо версію документа на сторінці "Політика конфіденційності". Будь ласка, періодично переглядайте ці умови, щоб бути поінформованими про те, як інтернет-магазин unreal-go.top захищає персональні дані своїх користувачів.</p>\`;"
        `;

	static yesHTML = `
                <div style="display: flex; flex-direction: column; align-items: center"><?xml version="1.0" encoding="iso-8859-1"?>
                    <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="80px" height="80px" x="0px" y="0px"
                    \t viewBox="0 0 50 50" style="enable-background:new 0 0 50 50;" xml:space="preserve">
                    <circle style="fill:#25AE88;" cx="25" cy="25" r="25"/>
                    <polyline style="fill:none;stroke:#FFFFFF;stroke-width:2;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;" points="
                    \t38,15 22,33 12,25 "/>
                    </svg>
                    <p class="p" style="text-align: center"> Замовлення сформоване. Очікуйте повідомлення на пошту. <br>
                    </p>
                </div>`;

	static yesProductAdded = `<div style="display: flex; flex-direction: column; align-items: center"><?xml version="1.0" encoding="iso-8859-1"?>
                <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="80px" height="80px" x="0px" y="0px"
                \t viewBox="0 0 50 50" style="enable-background:new 0 0 50 50;" xml:space="preserve">
                <circle style="fill:#25AE88;" cx="25" cy="25" r="25"/>
                <polyline style="fill:none;stroke:#FFFFFF;stroke-width:2;stroke-linecap:round;stroke-linejoin:round;stroke-miterlimit:10;" points="
                \t38,15 22,33 12,25 "/>
                </svg>
                <p class="p" style="text-align: center"> Товар додано до кошику </p></div>`;

	static errorBodyHtml = `<div>
                <p class="p required_alert" style="text-align: center"> Щось пішло не так!</p></div>`;

	static svgCart = `<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M20.94 18.06L19.26 8.31C19.1452 7.47997 18.7404 6.71734 18.1171 6.15725C17.4939 5.59716 16.6925 5.27576 15.855 5.25H15.75C15.75 4.25544 15.3549 3.30161 14.6516 2.59835C13.9484 1.89509 12.9946 1.5 12 1.5C11.0054 1.5 10.0516 1.89509 9.34834 2.59835C8.64508 3.30161 8.24999 4.25544 8.24999 5.25H8.14499C7.30746 5.27576 6.50608 5.59716 5.88285 6.15725C5.25961 6.71734 4.85475 7.47997 4.73999 8.31L3.05999 18.06C2.95681 18.6256 2.97924 19.2071 3.12569 19.7631C3.27215 20.3191 3.53905 20.8361 3.90749 21.2775C4.21794 21.6565 4.60801 21.9625 5.05001 22.1738C5.49201 22.385 5.9751 22.4964 6.46499 22.5H17.535C18.0249 22.4964 18.508 22.385 18.95 22.1738C19.392 21.9625 19.7821 21.6565 20.0925 21.2775C20.4609 20.8361 20.7278 20.3191 20.8743 19.7631C21.0208 19.2071 21.0432 18.6256 20.94 18.06ZM12 3C12.5967 3 13.169 3.23705 13.591 3.65901C14.0129 4.08097 14.25 4.65326 14.25 5.25H9.74999C9.74999 4.65326 9.98705 4.08097 10.409 3.65901C10.831 3.23705 11.4033 3 12 3ZM18.945 20.31C18.7755 20.522 18.5612 20.6938 18.3174 20.8131C18.0736 20.9325 17.8064 20.9963 17.535 21H6.46499C6.1936 20.9963 5.9264 20.9325 5.6826 20.8131C5.43881 20.6938 5.22447 20.522 5.05499 20.31C4.82644 20.0365 4.66146 19.7157 4.57197 19.3707C4.48247 19.0257 4.4707 18.6651 4.53749 18.315L6.21749 8.565C6.27332 8.08382 6.49734 7.63782 6.85001 7.30574C7.20268 6.97365 7.66132 6.77683 8.14499 6.75H15.855C16.3387 6.77683 16.7973 6.97365 17.15 7.30574C17.5026 7.63782 17.7267 8.08382 17.7825 8.565L19.4625 18.315C19.5293 18.6651 19.5175 19.0257 19.428 19.3707C19.3385 19.7157 19.1735 20.0365 18.945 20.31Z" fill="white"/>
                </svg>`;

}

const privacyHtml = InnerText.privacyHtml;
const yesHTML = InnerText.yesHTML;
const yesProductAdded = InnerText.yesProductAdded;
const svgCart = InnerText.svgCart;
const errorBodyHtml = InnerText.errorBodyHtml;

export {privacyHtml, yesHTML, yesProductAdded, svgCart, errorBodyHtml};
