/*
* Nodes
* */
let privacyBtn = document.querySelector('#privacy');


/*
* Listeners
* */

/*
* Functional
* */
let privacyHtml = `
        <p>Інтернет-магазин unreal-go.top приділяє велику увагу захисту персональних даних своїх користувачів. Користувачі інтернет-магазину unreal-go.top можуть переглядати сторінки сайту не повідомляючи про себе ніяких персональних даних. Однак, для надання послуг, пов'язаних з купівлею товарів, представлених в нашому інтернет-магазині, нам потрібні Ваші контактні дані для того, щоб ми могли зв'язатися з Вами, підтвердити замовлення і доставити Вам замовлений товар. Ваші персональні дані ми не передаємо третім особам і захищаємо їх конфіденційність.</p>
        <h4>ЗАГАЛЬНІ ПОЛОЖЕННЯ</h4>
        <p>Дана політика конфіденційності встановлює порядок отримання, зберігання, обробки, використання і розкриття персональних даних Користувача. Персональні дані Користувача ми отримуємо від Користувача при оформленні замовлення через корзину магазина, при оформленні замовлення за телефонами, які вказані на сайті, і при реєстрації самим Користувачем (створення Особистого кабінету). Персональні дані Користувача заповнюються Користувачем (при оформленні замовлення або при реєстрації на сайті). Обов'язкова для надання послуги інформація позначена спеціальним чином. Інша інформація надається Користувачем на його розсуд.</p>
        <p>Конфіденційність персональних даних - обов'язкова умова для дотримання магазином доступу до персональних даних Користувача, з вимогою не допускати їх поширення без згоди Користувача або наявності іншої законної підстави.</p>
        <p>Використання Користувачем сайту інтернет-магазину unreal-go.top означає згоду з цією Політикою конфіденційності та умовами обробки персональних даних Користувача.</p>
        <p>У випадку незгоди з умовами Політики Користувач повинен припинити використання сайту інтернет-магазину unreal-go.top.</p>
        <p>Ця Політика застосовується тільки до сайту інтернет-магазину unreal-go.top. Інтернет-магазин unreal-go.top не контролює і не несе відповідальність за сайти третіх осіб, на які Користувач може перейти по посиланнях, доступним на сайті інтернет-магазину unreal-go.top.</p>
        <p>Адміністрація сайту не перевіряє достовірність персональних даних, що надаються Користувачем сайту Інтернет-магазину.</p>
        <p>Користувач визнає, що в разі недбалого ставлення самим Користувачем до безпечного зберігання свого логіна і пароля, що дає доступ до його персональних даних, треті особи можуть отримати несанкціонований доступ до облікового запису, персональних і інших даних Користувача. Інтернет-магазин unreal-go.top не несе відповідальність за збитки завдані таким доступом.</p>
        <h4>ПЕРСОНАЛЬНІ ДАНІ</h4>
        <p>Інтернет-магазин unreal-go.top збирає персональні дані, а саме: ім'я, прізвище, контактний телефон, адреса для доставки. Також, ми можемо уточнити і отримати від Вас цю інформацію по телефону.</p>
        <p>Інша інформація надається Користувачем на його розсуд.</p>
        <p>Інтернет-магазин unreal-go.top не збирає IP-адреси користувачів.</p>
        <h4>ЦІЛІ ЗБОРУ І ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ</h4>
        <p>Інтернет-магазин unreal-go.top збирає і зберігає тільки ті персональні дані, які необхідні для надання послуг з продажу і доставки замовлених Вами товарів.</p>
        <p>Інтернет-магазин unreal-go.top збирає дані для зв'язку з Користувачем, в тому числі подання відповідного повідомлення про надання послуги, інформування Користувача про наявність товару, підтвердження замовлення, доставки замовлених Користувачем товарів, для зв'язку кур'єрської служби з Користувачем, а також для обробки запитів і заявок від Користувача.</p>
        <p>Обробка персональних даних Користувача здійснюється без обмеження терміну, будь-яким законним способом.</p>
        <h4>УМОВИ НАДАННЯ ДОСТУПУ ДО БАЗИ ДАНИХ</h4>
        <p>Ми не передаємо персональні дані Користувача третім особам крім випадків визначених законодавством України.</p>
        <p>Розкриття персональних даних Користувача проводиться при замовленні Користувачем товарів в інтернет-магазині unreal-go.top. Зокрема Користувач погоджується з тим, що інтернет-магазин unreal-go.top має права передавати персональні дані кур'єрським службам, організаціям поштового зв'язку, операторам електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на сайті інтернет-магазину unreal-go.top, включаючи доставку Товару.
        </p>
        <p>При втраті або розголошення персональних даних інтернет-магазин unreal-go.top інформує Користувача про втрату або розголошення персональних даних.</p>
        <p>Інтернет-магазин unreal-go.top приймає необхідні організаційні та технічні заходи для захисту персональної інформації Користувача від неправомірного або випадкового доступу, знищення, перекручення, блокування, копіювання, поширення, а також від інших неправомірних дій третіх осіб.</p>
        <h4>ЗМІНА КОРИСТУВАЧЕМ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ</h4>
        <p>Користувач може в будь-який момент змінити (оновити, доповнити, видалити) надану їм персональну інформацію або її частину, скориставшись функцією входу в "Особистий кабінет".</p>
        <h4>ЗМІНА ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h4>
        <p>Ми маємо право змінити умови Політики конфіденційності. У такому випадку, ми замінимо версію документа на сторінці "Політика конфіденційності". Будь ласка, періодично переглядайте ці умови, щоб бути поінформованими про те, як інтернет-магазин unreal-go.top захищає персональні дані своїх користувачів.</p>`;

let modal = new Modal(privacyBtn, ".modal-wrapper");

modal.setTitle('ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ')
    .setDescription(privacyHtml)
    .init();
